In [78]:
#exer 1, #3
from env import get_db_url
import pandas as pd
import numpy as np
from pydataset import data

In [2]:
pd.read_sql('SELECT * FROM employees LIMIT 5',get_db_url("employees"))

   emp_no  birth_date first_name last_name gender   hire_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [3]:
#5a - url typo
#pd.read_sql('SELECT * FROM employees LIMIT 5',emp_url+'hi') 
#Operational Error
#1044 access denied for user

In [4]:
#5b - SQL query error typo
#pd.read_sql('SELECT * FROM employee LIMIT 5',emp_url)
#ProgrammingError
#1146, "Table 'employees.employee' doesn't exist"
#. Seems to return the error from SQL

In [5]:
#6
emp = pd.read_sql('SELECT * FROM employees',get_db_url("employees"))
ttl = pd.read_sql('SELECT * FROM titles',get_db_url("employees"))

In [6]:
#7
print(emp.shape)
print(ttl.shape)

(300024, 6)
(443308, 4)

In [7]:
#8
emp.describe() #only describes numeric columns (ignores strings and dates)
ttl.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [8]:
#9
ttl.title.nunique()

7

In [9]:
#10
#imported datetime above
# ttl['d'], ttl['m'], ttl['y'] = ttl.to_date.str.split('-')
# ttl['to_date'].str.split('-')
ttl.to_date.min()
#APPARENTLY PANDAS HAS DATETIME?!

datetime.date(1985, 3, 1)

In [25]:
ttl.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 443308 entries, 0 to 443307
Data columns (total 7 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   emp_no     443308 non-null  int64
 1   title      443308 non-null  object
 2   from_date  443308 non-null  object
 3   to_date    443308 non-null  object
 4   t_y        443308 non-null  object
 5   t_m        443308 non-null  object
 6   t_d        443308 non-null  object
dtypes: int64(1), object(6)
memory usage: 23.7+ MB

In [10]:
#11
ttl.to_date.max()

datetime.date(9999, 1, 1)

In [19]:
#Odd alternative
#even though column identified as object, needs to be converted to str
#then split into 3 columns
ttl[['t_y','t_m','t_d']] = ttl.to_date.astype(str).str.split('-',expand=True)

Exercises - Part 2

In [55]:
#1
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})

In [61]:
#2 - right join
users.merge(roles,how='right',left_on='role_id',right_on='id',indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

In [63]:
#3 - outer join
users.merge(roles,how='outer',left_on='role_id',right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [75]:
#4
#this question is odd.  Since we have to sp
users.merge(roles) #gets empty table
u2 = users.drop(columns='role_id')
r2 = roles.drop(columns='id')
u2.merge(r2) #gets the same empy df
#u2.merge(r2,how='outer',left_on='role_id',right_on='id') 
#naturally throws an error, since I deleted these columns

Empty DataFrame
Columns: [id, name]
Index: []

In [79]:
#5 - load mpg
mpg = data('mpg')

In [80]:
#6 - mpg doc
data('mpg',show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [82]:
#7 - num rows/cols
print(f'The mpg dataframe has {mpg.shape[0]} rows and {mpg.shape[1]} columns')

The mpg dataframe has 234 rows and 11 columns

In [87]:
#8
mpg.rename(columns={'manufacturer':'make'},inplace=True)

In [88]:
#9
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

In [90]:
#10
print(f'There are {mpg.make.nunique()} manufacturers in this dataset')

There are 15 manufacturers in this dataset

In [91]:
#11
print(f'There are {mpg.model.nunique()} models in this dataset')

There are 38 models in this dataset

In [96]:
#12
mpg['mpg_diff'] = mpg.hwy - mpg.cty

In [103]:
#13
mpg['avg_mpg'] = (mpg.hwy)

In [110]:
#14
mpg.trans.unique() #confirm format of the column
mpg['is_automatic']=mpg.trans.str.startswith('a')

In [116]:
#15
mpg.groupby('make').agg({'avg_mpg':'mean'}).nlargest(columns = 'avg_mpg',n=1)

         avg_mpg
make
honda  32.555556

In [117]:
#16
mpg.groupby('is_automatic').agg({'avg_mpg':'mean'}) 
#manuals have better mpg

                avg_mpg
is_automatic
False         25.779221
True          22.292994